## Pandas

In [5]:
import pandas as pd
s = pd.Series(['하나','둘','셋'],index = [i for i in range(1,4)])
s

1    하나
2     둘
3     셋
dtype: object

In [6]:
s2 = pd.Series([9_904_312, 3_448_737,2_890_451,2_466_052],index=['서울','부산','인천','대구'])
s2

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

### 연습문제

In [10]:
s3 = pd.Series([10,20,30,40,50,60,70,80,90],index=None)
s3

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [24]:
print(s3.index)
print(s3.values)
type(s3.values) # 값이 ndarray 형태

RangeIndex(start=0, stop=9, step=1, name='도시')
[10 20 30 40 50 60 70 80 90]

numpy.ndarray

In [30]:
s3[s3>50].count()
# 방법 2  sum(s3>50)

도시
0    False
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
Name: 인구, dtype: bool

In [21]:
s3.name='인구'       #데이터 이름 주기
s3.index.name='도시' #index에 이름 주기 
s3

도시
0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
Name: 인구, dtype: int64

In [22]:
d = {'a':1 , 'b':2 , 'c':3}  # 딕셔너리 series 로 만들기 
ser = pd.Series(data=d,index=['a','b','c'])
ser

a    1
b    2
c    3
dtype: int64

In [ ]:
d = {'a':1 , 'b':2 , 'c':3}  
ser = pd.Series(data=d,index=['x','y','z'])
ser # 딕셔너리로 series만들면 index 가 딕셔너리의 key로 자동지정

x   NaN
y   NaN
z   NaN
dtype: float64

In [265]:
s4 = pd.Series({'서울':1_904_312,'부산':1_448_737,'인천':3_890_451,'대구':4_466_052})
s4

서울    1904312
부산    1448737
인천    3890451
대구    4466052
dtype: int64

### 연습문제

In [27]:
s5 = pd.Series({'철수':88,'영희':95,'길동':100,'몽룡':34})
s5

철수     88
영희     95
길동    100
몽룡     34
dtype: int64

In [31]:
'철수' in s5

True

In [66]:
88 in s5.values

True

In [64]:
test = dict(zip(range(10),list('영일이삼사오육칠팔구')))
test

{0: '영',
 1: '일',
 2: '이',
 3: '삼',
 4: '사',
 5: '오',
 6: '육',
 7: '칠',
 8: '팔',
 9: '구'}

In [33]:
for k,v in s5.items():
    print(f'{k} {v}')

철수 88
영희 95
길동 100
몽룡 34

In [76]:
for _ , v in s5.items(): # values 만 가져오고 싶을떄 
    print(f'{v}')

88
95
100
34

### 연습문제

In [82]:
for k,v in s4.items():
    if v >3000000:
        print(f'{k}의 인구는 300만이 넘습니다.')

인천의 인구는 300만이 넘습니다.
대구의 인구는 300만이 넘습니다.

### series 슬라이싱

In [266]:
s4[1] ,s4['부산'] # 슬라이싱도 가능하다(값을 가져올떄)

(1448737, 1448737)

In [45]:
s4[[0,3,1]]
s4[['서울','대구','부산']]

서울    1904312
대구    4466052
부산    1448737
dtype: int64

In [46]:
s4[[0]] #하나의 series를 가져올떄

서울    9904312
dtype: int64

### 연습문제

In [47]:
s4[[2]]

인천    2890451
dtype: int64

In [48]:
s4[1:3]

부산    3448737
인천    2890451
dtype: int64

In [54]:
s4[[1,2,3]]

부산    3448737
인천    2890451
대구    2466052
dtype: int64

### series 연산

In [55]:
a= pd.Series([999999,3333333,2222222,1111111],index=['서울','부산','인천','대구'])
a.name='인구'
a.index.name='도시'
a

도시
서울     999999
부산    3333333
인천    2222222
대구    1111111
Name: 인구, dtype: int64

In [61]:
a2 = pd.Series({'서울':5555555,'부산':3333333,'인천':2222222,'대전':1542353})
a2

서울    5555555
부산    3333333
인천    2222222
대전    1542353
dtype: int64

In [84]:
k = a-a2 # 한쪽에 없는 값은 NAN으로 나옴
k

대구          NaN
대전          NaN
부산          0.0
서울   -4555556.0
인천          0.0
dtype: float64

In [85]:
k.isnull() # null값 있으면 True

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [86]:
k.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [89]:
k[k.notnull()] # null이 아닌값들 출력

부산          0.0
서울   -4555556.0
인천          0.0
dtype: float64

In [ ]:
del rs['서울']

### 가벼운 실습

In [94]:
c = pd.Series({'서울':9904312,'부산':3448737,'인천':2890451,'대구':2466052}) #2015년 인구
c2 = pd.Series({'서울':9631482,'부산':3393191,'인천':2632035,'대전':1490158}) # 2010년 인구
rs = (c-c2) / c2*100 # 인구 증가율
rs = rs[rs.notnull()] # null이 아닌 즉 TRUE인 값에 대해서만 출력 
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

### 연습문제

In [124]:
c = pd.Series({'서울':9904312,'부산':3448737,'인천':2890451,'대구':2466052}) #2015년 인구
c2 = pd.Series({'서울':9631482,'부산':3393191,'인천':2632035,'대전':1490158}) # 2010년 인구
rk = c-c2
rk2 = rk[rk.notnull()]
rk3 = rk2.argmax() # 최대값의 index를 반환해줌 
rk2[[rk3]]

서울    272830.0
dtype: float64

### 연습문제

In [114]:
rs['서울'] = 2.83 
rs['인천'] = 9.82
rs

#방법 2
rs['서울':'인천'] = (2.83,9.82)
rs

부산    1.63
서울    2.83
인천    9.82
dtype: float64

### 연습문제

In [122]:
fin1 = {"카카오":60010, "삼성전자":61000, "LG전자": 90000}
fin2_value = [60200, 61200, 200100]
fin2_index = ["카카오", "삼성전자", "네이버"]

ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_value,fin2_index)

카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

### 연습문제

In [194]:
ser_finance1 - ser_finance2
ser_finance1 + ser_finance2
ser_finance1 * ser_finance2
ser_finance1 / ser_finance2
# 결과가 모두다 float형태로 나오는데 Nan이 있기 때문에

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

### 연습문제

In [126]:
result = ser_finance1 - ser_finance2
result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

### DataFrame class

In [227]:
d = {'col1':[1,2] ,'col2':[3,4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [231]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9762546, 3512547, 2517680, 2456016],
    "2000" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율" :[0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index = index, columns = columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [ ]:
df.values
df.columns
df.index

In [232]:
df.index.name='도시'
df.columns.name ='특성'
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [233]:
df.dtypes

특성
지역                object
2015               int64
2010               int64
2005               int64
2000               int64
2010-2015 증가율    float64
dtype: object

### 연습문제

In [264]:
data = {
    "이름" : ['바디앤짐', '프레토휘트니스', '비비짐', '바디디자인샵'],
    "네이버 리뷰수" : [81, 75, 54,12],
    "블로그 리뷰수" : [73, 107, 36, 2],
    "평점" : [4.3, 4.27, 5, 4.83],
    "오픈시간" : ["06시", "06시", "06", "06시"],
    "종료시간" :['24시','24시' , '23시', '22시'],
    '휴무일' : ['매달2,4번째 일요일','매달2,4번째 일요일','매달1,3,5번쨰 일요일','매주일요일'],
    '가격' : ['3개월21만원' , '3개월22만원','3개월24만원','3개월24만원'],
    '거리' : [302,269,449,235]
}
columns = ["이름", "네이버 리뷰수", "블로그 리뷰수", "평점", "오픈시간", "종료시간",'휴무일','가격','거리']
index = ['헬스장1','헬스장2','헬스장3','헬스장4']
df = pd.DataFrame(data, index = index, columns = columns)
df


df.loc[df['종료시간']=='24시','죵료시간점수'] =3
df.loc[df['종료시간']=='23시','죵료시간점수'] =2
df.loc[df['종료시간']=='22시','죵료시간점수'] =1
df

df.loc[df['거리']<=300,'거리점수'] =2
df.loc[df['거리']>300,'거리점수']=1
df

df.loc[df['가격']=='3개월24만원','가격점수'] =1
df.loc[df['가격']=='3개월22만원','가격점수'] =2
df.loc[df['가격']=='3개월21만원','가격점수'] =3
df

df['최종점수'] = df['죵료시간점수'] * 0.3 +df['거리점수'] * 0.4 +df['가격점수'] * 0.5
df

,이름,네이버 리뷰수,블로그 리뷰수,평점,오픈시간,종료시간,휴무일,가격,거리,죵료시간점수,거리점수,가격점수,최종점수
헬스장1,바디앤짐,81,73,4.30,06시,24시,"매달2,4번째 일요일",3개월21만원,302,3.0,1.0,3.0,2.8
헬스장2,프레토휘트니스,75,107,4.27,06시,24시,"매달2,4번째 일요일",3개월22만원,269,3.0,2.0,2.0,2.7
헬스장3,비비짐,54,36,5.00,06,23시,"매달1,3,5번쨰 일요일",3개월24만원,449,2.0,1.0,1.0,1.5
헬스장4,바디디자인샵,12,2,4.83,06시,22시,매주일요일,3개월24만원,235,1.0,2.0,1.0,1.6

In [134]:
df2 = df.T # 행렬전환
df2

           서울       부산       인천        대구
지역        수도권      경상권      수도권       전라권
2015  9904312  3448737  2890451   2466052
2010  9631482  3393191  2632023   2121211
2005  9762222   111111  1111111  11111111

In [135]:
df2['부산']=df2['부산'] * 2 #갱신
df2

           서울       부산       인천        대구
지역        수도권   경상권경상권      수도권       전라권
2015  9904312  6897474  2890451   2466052
2010  9631482  6786382  2632023   2121211
2005  9762222   222222  1111111  11111111

In [140]:
df['2005~2010증가율'] = ((df['2010'] - df['2005']) / df['2005'] * 100).round(2)
df

     지역     2015     2010      2005  2005~2010증가율
서울  수도권  9904312  9631482   9762222         -1.34
부산  경상권  3448737  3393191    111111       2953.87
인천  수도권  2890451  2632023   1111111        136.88
대구  전라권  2466052  2121211  11111111        -80.91

In [143]:
df['지역'] # 지역 column의 값을 봄
df[['지역']] # 지역 column dataframe 형태로 봄 
df[['2010','2015']] # 2010 2015 column의 값을 봄

서울    수도권
부산    경상권
인천    수도권
대구    전라권
Name: 지역, dtype: object

In [154]:
import numpy as np
df3 = pd.DataFrame(np.arange(12).reshape(3,4))
df3
print(df3[0]) # 1열만 뽑아줌

0    0
1    4
2    8
Name: 0, dtype: int32

### DataFrame row 슬라이싱

In [188]:
df[:2] # 1행,2행 출력
df[['지역','2015']][:3]# 1~3행 지역,2015칼럼 출력

     지역     2015
서울  수도권  9904312
부산  경상권  3448737
인천  수도권  2890451

In [189]:
type(df[['지역','2015']][:3])

pandas.core.frame.DataFrame

In [190]:
df['2015'][:1]

서울    9904312
Name: 2015, dtype: int64

In [191]:
type(df['2015'][:1])

pandas.core.series.Series

In [192]:
df['2015']['서울']

9904312

In [193]:
type(df['2015']['서울'])

numpy.int64

In [ ]:
df[1:2] ## == df['부산':'부산']

In [269]:
data = {
 "국어": [80, 90, 70, 30],
 "영어": [90, 70, 60, 40],
 "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

### 연습문제

In [290]:
df['수학'] #1번
df[['국어','영어']] #2번
df['평균'] = (df['국어'] + df['영어'] + df['수학']) / 3 #3번
df[:1] #4번
df2 = df.T
df2
df2['향단']

국어    70
영어    60
수학    80
Name: 향단, dtype: int64

In [230]:
np.random.seed(0)
data = np.random.randn(24).reshape(6,4)
index = pd.date_range('20130226',periods=6)
columns=['A','B','C','D']
df = pd.DataFrame(data,index,columns)
df

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165